In [63]:
import pandas as pd

In [64]:
data = pd.read_excel("IPL.xls")
data.head()

,Match_Number,Match,Date,Year,Venue,Team_Batting_First,Team_Batting_Second,Bat_First_Runs_Scored,Bat_First_Wickets_Lost,Bat_First_Overs_Consumed,...,Bat_Second_10_ov_score,Bat_Second_10_ov_wkts_lost,Bat_Second_10_ov_Req_RR,Bat_Second_15_ov_score,Bat_Second_15_ov_wkts_lost,Bat_Second_15_ov_Req_RR,Bat_Second_20_ov_score,Bat_Second_20_ov_wkts_lost,Match_Time,Duckworth Lewis Used
0,1,League Match,Apr 18,2008,Bangalore,Kolkata,Bangalore,222,3,20.0,...,51.0,7.0,17.2,81.0,9.0,28.4,NaN,NaN,Evening,NaN
1,2,League Match,Apr 19,2008,Mohali,Chennai,Punjab,240,5,20.0,...,110.0,1.0,13.1,165.0,3.0,15.2,207.0,4.0,Afternoon,NaN
2,3,League Match,Apr 19,2008,Delhi,Rajasthan,Delhi,129,8,20.0,...,86.0,1.0,4.4,128.0,1.0,0.4,NaN,NaN,Evening,NaN
3,4,League Match,Apr 20,2008,Kolkata,Hyderabad,Kolkata,110,10,18.4,...,38.0,3.0,7.3,81.0,4.0,6.0,NaN,NaN,Afternoon,NaN
4,5,League Match,Apr 20,2008,Mumbai,Mumbai,Bangalore,165,6,20.0,...,76.0,3.0,9.0,118.0,4.0,9.6,166.0,5.0,Evening,NaN

### Task-1

In [65]:
YEAR_2008 = data[data["Year"] == 2008]
total_2008 = len(YEAR_2008)
len(YEAR_2008)

58

In [66]:
BAT_WIN_2008 = YEAR_2008[YEAR_2008["Winner"] == YEAR_2008["Team_Batting_First"]]
len(BAT_WIN_2008)

22

In [67]:
BAT_WIN_2008 = YEAR_2008[YEAR_2008["Winner"] == YEAR_2008["Team_Batting_Second"]]
len(BAT_WIN_2008)

36

In [68]:
task_1_data = []
for i in range(2008,2016):
#     print("YEAR:",i)
    year = data[data["Year"] == i]
#     print("Total:",len(year))
    bat_first = year[year["Winner"] == year["Team_Batting_First"]]
#     print("Bat First:",len(bat_first))
    bat_second = year[year["Winner"] == year["Team_Batting_Second"]]
#     print("Bat Second:",len(bat_second))
#     print("-------------------------------------")
    temp = []
    temp.append(len(year))
    temp.append(len(bat_first))
    temp.append(len(bat_second))
    task_1_data.append(temp)
task_1_data

[[58, 22, 36],
 [57, 26, 30],
 [60, 31, 28],
 [72, 32, 40],
 [74, 34, 40],
 [76, 37, 37],
 [60, 22, 37],
 [57, 32, 24]]

In [70]:
tie = []
for i in range(len(task_1_data)):
    tie.append(task_1_data[i][0]-task_1_data[i][1]-task_1_data[i][2])
tie

[0, 1, 1, 0, 0, 2, 1, 1]

In [44]:
index = [i for i in range(2008,2016)]
index

[2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015]

In [72]:
task_1 = pd.DataFrame(data =task_1_data,columns = ["Total","Bat_First","Bat_second"],index = index)
task_1["Tie"] = tie
task_1

      Total  Bat_First  Bat_second  Tie
2008     58         22          36    0
2009     57         26          30    1
2010     60         31          28    1
2011     72         32          40    0
2012     74         34          40    0
2013     76         37          37    2
2014     60         22          37    1
2015     57         32          24    1

### Task-2

In [51]:
venue = data["Venue"].value_counts()
venue[:5]

Mumbai       62
Chennai      48
Kolkata      47
Bangalore    47
Delhi        45
Name: Venue, dtype: int64

In [53]:
print(f"Most matches at Mumbai and number of matches is 62")

Most matches at Mumbai and number of matches is 62

### Task-3

In [61]:
max_run = data["Bat_First_Runs_Scored"].max()
max_run

263

In [62]:
data[data["Bat_First_Runs_Scored"] == max_run]

,Match_Number,Match,Date,Year,Venue,Team_Batting_First,Team_Batting_Second,Bat_First_Runs_Scored,Bat_First_Wickets_Lost,Bat_First_Overs_Consumed,...,Bat_Second_10_ov_score,Bat_Second_10_ov_wkts_lost,Bat_Second_10_ov_Req_RR,Bat_Second_15_ov_score,Bat_Second_15_ov_wkts_lost,Bat_Second_15_ov_Req_RR,Bat_Second_20_ov_score,Bat_Second_20_ov_wkts_lost,Match_Time,Duckworth Lewis Used
351,352,League Match,Apr 23,2013,Bangalore,Bangalore,Pune,263,5,20.0,...,76.0,4.0,18.8,111.0,5.0,30.6,133.0,9.0,Afternoon,NaN